displaying-associations-rails-lab-web-0716/app/views/artists/show.html.erb

<h2><%= @artist.name %></h2>
<%= @artist.songs.count %> songs(s):
---
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT COUNT(*) FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]